Config.org
#+title: Emacs configuration file
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
#+OPTIONS: toc:nil

This is my personal emacs configuration. I will be using org-babel to generate the configuration file based on this org file.
=REMEMBER= to install sqlite3

* Contents Table :toc:
- [[#basic-configuration][Basic Configuration]]
- [[#font-configuration][Font Configuration]]
- [[#package][Package]]
  - [[#package-vertico][Vertico]]
  - [[#package-consult][Consult]]
  - [[#package-doom-modeline][Doom Modeline]]
  - [[#package-rainbow-delimiters][Rainbow Delimiters]]
  - [[#package-which-key][Which Key]]
  - [[#package-catppuccin][Catppuccin Theme]]
  - [[#package-icons][Icons]]
  - [[#package-general][General]]
  - [[#package-evil][Evil]]
  - [[#package-hydra][Hydra]]
  - [[#package-projectile][Projectile]]
  - [[#package-magit][Magit]]
  - [[#package-forge][Forge]]
  - [[#package-org][Org Mode]]
- [[#keymaps][Keymaps]]


* Package manager
:properties:
:custom_id: package-manager
:end:
I use [[https://github.com/radian-software/straight.el][straight.el]] to manage emacs packages. It will also integrate with use-package.

#+begin_src emacs-lisp

  ;; Install Straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
		 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
		(bootstrap-version 6))
	(unless (file-exists-p bootstrap-file)
	  (with-current-buffer
		  (url-retrieve-synchronously
		   "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
		   'silent 'inhibit-cookies)
		(goto-char (point-max))
		(eval-print-last-sexp)))
	(load bootstrap-file nil 'nomessage))
  ;; Prevent package.el loading packages prior to their init-file loading.
  (setq package-enable-at-startup nil)

  ;; use-package integration with straight.el
  (straight-use-package 'use-package)

#+end_src


* Basic Configuration
:properties:
:custom_id: basic-configuration
:end:
This section contains the basic configuration, like wether or not show startup message, visible bell, etc.
#+begin_src emacs-lisp 
  ;; Configuration start
  (setq inhibit-startup-message t)    ; Remove startup message
  ;; Also here you can do 'system-type' so we don't show visible bell on macos
  (setq visible-bell t)               ; Make notification visible instead of sound

  (scroll-bar-mode -1)                ; Disable scrollbar
  (tool-bar-mode -1)                  ; Disable toolbar
  (tooltip-mode -1)                   ; Disable tooltip
  (menu-bar-mode -1)                  ; Disable menubar
  (set-fringe-mode '(10 . 10))        ; Set left and right margin in pixels

  ;; Enable line numbers
  (column-number-mode)
  (global-display-line-numbers-mode t)
  (setq display-line-numbers-type 'relative)
  ;; Disable line numners for some modes
  (dolist (mode '(
                  ;;org-mode-hook
                  term-mode-hook
                  dired-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook))
          (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (setq-default tab-width 4)
  (setq-default indent-tabs-mode nil)

#+end_src


* Config folder declutter
This steps will declutter the user configuration file so it will make version control easier.
#+begin_src emacs-lisp

  ;; Create a tmp folder inside emacs config so all the backup files go there
  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))

  ;; Create another tmp directory for auto-saave files
  (make-directory (expand-file-name "tmp/auto-saves" user-emacs-directory) t)

  ;; Set auto-saves to be store in the new folder
  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/session" user-emacs-directory)
    auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

  ;; If you want to disable lock files, uncomment this line (NOT RECOMMENDED)
  ;(setq create-lockfiles nil)

  ;; Adding package to take care of the rest
  (use-package no-littering
    :straight t)

#+end_src


* Font Configuration
:properties:
:custom_id: font-configuration
:end:
This set the default mode for either fix or variable type.
The *variable pitch* type is being used for the majority of the org-mode stuff except code snippets and tables.
The *fixed pitch* type font is used for all the rest of the text.

#+begin_src emacs-lisp

  ;; Load fonts
  (set-face-attribute 'default nil :font "SauceCodePro Nerd Font" :height 120)
  (set-face-attribute 'fixed-pitch nil :font "SauceCodePro Nerd Font" :height 120)
  (set-face-attribute 'variable-pitch nil :font "Comfortaa" :height 120)

#+end_src


* Packages
:properties:
:custom_id: packages
:end:

** Vertico
:properties:
:custom_id: package-vertico
:end:
The [[https://github.com/minad/vertico][Vertico.el]] package is used for interactive completion. It allows Emacs to have a completion list.
We also use [[https://www.emacswiki.org/emacs/SaveHist][Save Hist]] included plugin so vertico can order list using usage history.
#+begin_src emacs-lisp

  ;; Vertico package
  (use-package vertico
	:straight t
	;; Fix this ------
	:bind (:map vertico-map
				("C-j" . vertico-next)
				("C-k" . vertico-previous)
				("C-q" . vertico-exit))
	:init
	(vertico-mode)

	;; Different scroll margin
	; (setq vertico-scroll-margin 0)

	;; Show more candidates
	(setq vertico-count 20)

	;; Grow and shrink the Vertico minibuffer
	; (setq vertico-resize t)

	;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
	; (setq vertico-cycle t)
	)

  ;; Persist history over Emacs restarts. Vertico sorts by history position.
  (use-package savehist
	:straight t
	:init (savehist-mode))

#+end_src

** Consult
:properties:
:custom_id: package-consult
:end:
The [[https://github.com/minad/consult][Consult.el]] package provides search and navigation commands. This will integrate with [[#vertico][vertico]] to show list matching your searching criteria.
#+begin_src emacs-lisp

  ;; Consult package
  (use-package consult
    :straight t
    :hook (completion-list-mode . consult-preview-at-point-mode)
    :config
    (setq consult-project-root-function #'projectile-project-root)
  )

#+end_src

** Orderless
:properties:
:custom_id: package-orderless
:end:
[[https://github.com/oantolin/orderless][Orderless]] completion style for emacs
#+begin_src emacs-lisp
(use-package orderless
  :straight t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src

** Marginalia
:properties:
:custom_id: package-marginalia
:end:
[[https://github.com/minad/marginalia/][Marginalia]] adds help guide to the minibuffer
#+begin_src emacs-lisp

  ;; Enable rich annotations using the Marginalia package
  (use-package marginalia
  :straight t
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))
  ;; The :init section is always executed.
  :init

  ;; Marginalia must be actived in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode))

#+end_src

** Embark
:properties:
:custom_id: package-embark
:end:
[[https://github.com/oantolin/embark/][Embark]] makes easy to choose a command
#+begin_src emacs-lisp

  (use-package embark
    :straight t

    :bind
    (("C-." . embark-act)         ;; pick some comfortable binding
     ("C-;" . embark-dwim)        ;; good alternative: M-.
     ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

    :init

    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)

    ;; Show the Embark target at point via Eldoc.  You may adjust the Eldoc
    ;; strategy, if you want to see the documentation from multiple providers.
    (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
    ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

    :config

    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

#+end_src

*** Make embark and consult work together
#+begin_src emacs-lisp
;; Consult users will also want the embark-consult package.
(use-package embark-consult
  :straight t ; only need to install it, embark loads it after consult if found
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

** Doom Modeline
:properties:
:custom_id: package-doom-modeline
:end:
[[https://github.com/seagle0128/doom-modeline][Doom Modeline]] is a fancy and fast modeline inspired by minimali
#+begin_src emacs-lisp

  ;; Doom Modeline
  (use-package doom-modeline
	:straight t
	:init (doom-modeline-mode 1))
  
#+end_src
