Config.org
** Treemacs
[[https://github.com/Alexander-Miller/treemacs][Treemacs]] its a tree layout file explorer for Emacs
#+begin_src emacs-lisp

  (use-package treemacs
    :straight t
    :defer t
    :init
      (with-eval-after-load 'winum
        (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :config
      ;; The default width and height of the icons is 22 pixels. If you are
      ;; using a Hi-DPI display, uncomment this to double the icon size.
      ;;(treemacs-resize-icons 44)

      (treemacs-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode 'always)
      (when treemacs-python-executable
        (treemacs-git-commit-diff-mode t))

      (pcase (cons (not (null (executable-find "git")))
                   (not (null treemacs-python-executable)))
        (`(t . t)
         (treemacs-git-mode 'deferred))
        (`(t . _)
         (treemacs-git-mode 'simple)))

      (treemacs-hide-gitignored-files-mode nil)

    :bind
    (:map global-map
          ("M-0"       . treemacs-select-window)
          ("C-x t 1"   . treemacs-delete-other-windows)
          ("C-x t t"   . treemacs)
          ("C-x t d"   . treemacs-select-directory)
          ("C-x t B"   . treemacs-bookmark)
          ("C-x t C-t" . treemacs-find-file)
          ("C-x t M-t" . treemacs-find-tag)))

  (use-package treemacs-evil
    :after (treemacs evil)
    :straight t)

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :straight t)

  ;;(use-package treemacs-icons-dired
    ;;:after (all-the-icons)
    ;;:hook (dired-mode . treemacs-icons-dired-enable-once)
    ;;:straight t)

  (use-package treemacs-magit
    :after (treemacs magit)
    :straight t)

  (use-package lsp-treemacs
    :after lsp
    :straight t)

  ;;(use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
    ;;:after (treemacs persp-mode) ;;or perspective vs. persp-mode
    ;;:ensure t
    ;;:config (treemacs-set-scope-type 'Perspectives))

  ;;(use-package treemacs-tab-bar ;;treemacs-tab-bar if you use tab-bar-mode
    ;;:after (treemacs)
    ;;:ensure t
    ;;:config (treemacs-set-scope-type 'Tabs))
#+end_src
** Rainbow Delimiters
:properties:
:custom_id: package-rainbow-delimiters
:end:
[[https://github.com/Fanael/rainbow-delimiters][Raibow Delimiters]], as the name suggest, is a rainbow-like parentheses mode
#+begin_src emacs-lisp

  ;; Rainbow delimiter
  (use-package rainbow-delimiters
	:straight t
	:hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** Which Key
:properties:
:custom_id: package-which-key
:end:
Emacs [[https://github.com/justbur/emacs-which-key][Which Key]] plugin. This will display legends at the botton showing the list of combitation that follow the one you just did.
#+begin_src emacs-lisp

  ;; Which key
  (use-package which-key
	:straight t
	:init (which-key-mode)
	:config
	(setq which-key-idle-delay 0.2))

#+end_src

** Catppuccin Theme
:properties:
:custom_id: package-catppuccin-theme
:end:
[[https://github.com/catppuccin/emacs][Catppuccin Theme]] for emacs
#+begin_src emacs-lisp

  ;; Insatll Catppuccin theme
  (use-package catppuccin-theme
	:straight t
	:config
	(setq catppuccin-flavor 'mocha)
	:init
	(load-theme 'catppuccin t))

#+end_src

** Icons
:properties:
:custom_id: package-icons
:end:
Some icons packages like [[https://github.com/domtronn/all-the-icons.el][all-the-icons]] and [[https://github.com/rainstormstudio/nerd-icons.el][nerd-icons]]. I should already have the fonts on the dotfiles, but just in case I add them here. Remember to run the commands ~all-the-icons-install-fonts~ and ~nerd-icons-install-fonts~.
#+begin_src emacs-lisp

  ;; Icons
  (use-package all-the-icons
	:straight t
	:if (display-graphic-p))
  (use-package nerd-icons
	:straight t)

#+end_src

** General
:properties:
:custom_id: package-general
:end:
[[https://github.com/noctuid/general.el][General.el]] provides a convenient method for binding keys.
#+begin_src emacs-lisp

  (use-package general
	:straight t
	:config
	(general-create-definer poli/leader-keys
							:keymaps '(normal insert visual emacs)
							;; This will be used as a leader in all modes but insert
							:prefix "SPC"
							;; This will be used as a leader key when on insert mode
							:global-prefix "C-SPC"))

#+end_src

** Evil
:properties:
:custom_id: package-evil
:end:
[[https://github.com/emacs-evil/evil][Evil]] is an extensible vi layer for emacs.
This also install [[https://github.com/emacs-evil/evil-collection][Evil Collection]] that is a collection for key-bindings for different emacs modes.
#+begin_src emacs-lisp

  (use-package evil
    :straight t
    :init
    ;; TODO: Learn what this does
    (setq evil-want-integration t)
    ;; Integration with other modes deactivate becase another package is used for that
    (setq evil-want-keybinding nil)
    ;; Make it so C-u scroll instead of emacs default behaviour
    (setq evil-want-C-u-scroll t)
    (evil-mode 1)
    :config
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    (evil-set-undo-system 'undo-redo)

    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line))

  (use-package evil-collection
    :straight t
    :after evil
    :init
    (evil-collection-init))

#+end_src
** Hydra
:properties:
:custom_id: package-hydra
:end:
The package [[https://github.com/abo-abo/hydra][Hydra]] is used to bind family of related commands. Basically instead of hold a key combination and press another. You use hydra to press a shortcut and not have to keep it.
#+begin_src emacs-lisp

  ;; Hydra package
  (use-package hydra
	:straight t)

  ;; Hydra definitions
  (defhydra hydra-text-scale (:timeout 4)
	"scale text"
	("j" text-scale-increase "in")
	("k" text-scale-decrease "out")
	("r" (text-scale-set 0) "reset")
	("q" nil "finish" :exit t))

#+end_src

** Projectile
:properties:
:custom_id: package-projectile
:end:
[[https://github.com/bbatsov/projectile][Projectile.el]] package give the ability to identify files that constitute a project, like a ~package.json~ for Node or ~composer.json~ for php.
#+begin_src emacs-lisp

  ;; Projectile
  (use-package projectile
	:straight t
	:init
	(projectile-mode)
	:config
	(when (file-directory-p "~/Projects")
	  ;; Limit the amount of subdirectories on which projectile will look into
	  (setq projectile-project-search-path '(("~/Projects" . 4))))
	;; This will show the directory structure when you switch project
	(setq projectile-switch-project-action #'projectile-dired))

#+end_src
** Magit
:properties:
:custom_id: package-magit
:end:
[[https://magit.vc/][Magit]] is a text-based UI for Git
#+begin_src emacs-lisp

  ;; Magit
  (use-package magit
	:straight t
	:custom
	(magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1))

#+end_src
** Forge
:properties:
:custom_id: package-forge
:end:
[[https://github.com/magit/forge][Forge]] work on Github or Gitlab from the confort of [[#package-magit][magit]]
#+begin_src emacs-lisp

  ;; Forge
  (use-package forge
	:straight t
	:after magit)

#+end_src
** Org Mode
:properties:
:custom_id: package-org
:end:
text
#+begin_src emacs-lisp

	;; Org Mode
  (defun poli/org-mode-setup ()
    (variable-pitch-mode 0))

  (use-package org
	:straight t
	:hook (org-mode . poli/org-mode-setup)
	:config
	;; Face exceptions: These are the modes that will keep the fixed-pitch font
	(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
	(set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
	(set-face-attribute 'org-table nil :inherit 'fixed-pitch)


	;; Structure templates for code snippets, used on org-babel
	;; org-tempo is required for the templates to work
	(require 'org-tempo)
	(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))

	)

  (defun poli/org-auto-tangle ()
  (when (string-equal (buffer-file-name)
					  (expand-file-name "~/Projects/Personal/emacs/Config.org"))
  (let ((org-confirm-babel-evaluate nil))
  (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'poli/org-auto-tangle)))

  (use-package org-bullets
    :straight t
    :after org
    :hook (org-mode . org-bullets-mode))

#+end_src

** Flycheck
:properties:
:custom_id: package-flycheck
:end:
[[https://www.flycheck.org/en/latest/index.html][Flycheck]] its a syntax checking for GNU Emacs
#+begin_src emacs-lisp
(use-package flycheck
  :straight t
  :init (global-flycheck-mode))
#+end_src

** Company
:properties:
:custom_id: package-company
:end:
[[http://company-mode.github.io/][Company]] its a text completion framework for Emacs.
#+begin_src emacs-lisp

  (use-package company
    :straight t
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
            ("<tab>" . company-complete-selection))
          (:map lsp-mode-map
            ("<tab>" . company-indent-or-complete-common))
    :config
    (company-keymap--unbind-quick-access company-active-map)
    (setq company-idle-delay 0.0
          company-minimum-prefix-length 1))

#+end_src

We could also improve the company UI with the [[https://github.com/sebastiencs/company-box][Company Box]] package
#+begin_src emacs-lisp

  (use-package company-box
    :straight t
    :hook (company-mode . company-box-mode)
    :config
    (setq lsp-ui-doc-position 'bottom))

#+end_src

