init.el

(use-package treemacs
  :straight t
  :defer t
  :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
  :config
    ;; The default width and height of the icons is 22 pixels. If you are
    ;; using a Hi-DPI display, uncomment this to double the icon size.
    ;;(treemacs-resize-icons 44)

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode 'always)
    (when treemacs-python-executable
      (treemacs-git-commit-diff-mode t))

    (pcase (cons (not (null (executable-find "git")))
                 (not (null treemacs-python-executable)))
      (`(t . t)
       (treemacs-git-mode 'deferred))
      (`(t . _)
       (treemacs-git-mode 'simple)))

    (treemacs-hide-gitignored-files-mode nil)

  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t 1"   . treemacs-delete-other-windows)
        ("C-x t t"   . treemacs)
        ("C-x t d"   . treemacs-select-directory)
        ("C-x t B"   . treemacs-bookmark)
        ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag)))

(use-package treemacs-evil
  :after (treemacs evil)
  :straight t)

(use-package treemacs-projectile
  :after (treemacs projectile)
  :straight t)

;;(use-package treemacs-icons-dired
  ;;:after (all-the-icons)
  ;;:hook (dired-mode . treemacs-icons-dired-enable-once)
  ;;:straight t)

(use-package treemacs-magit
  :after (treemacs magit)
  :straight t)

(use-package lsp-treemacs
  :after lsp
  :straight t)

;;(use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
  ;;:after (treemacs persp-mode) ;;or perspective vs. persp-mode
  ;;:ensure t
  ;;:config (treemacs-set-scope-type 'Perspectives))

;;(use-package treemacs-tab-bar ;;treemacs-tab-bar if you use tab-bar-mode
  ;;:after (treemacs)
  ;;:ensure t
  ;;:config (treemacs-set-scope-type 'Tabs))

;; Rainbow delimiter
(use-package rainbow-delimiters
  :straight t
  :hook (prog-mode . rainbow-delimiters-mode))

;; Which key
(use-package which-key
  :straight t
  :init (which-key-mode)
  :config
  (setq which-key-idle-delay 0.2))

;; Insatll Catppuccin theme
(use-package catppuccin-theme
  :straight t
  :config
  (setq catppuccin-flavor 'mocha)
  :init
  (load-theme 'catppuccin t))

;; Icons
(use-package all-the-icons
  :straight t
  :if (display-graphic-p))
(use-package nerd-icons
  :straight t)

(use-package general
  :straight t
  :config
  (general-create-definer poli/leader-keys
						  :keymaps '(normal insert visual emacs)
						  ;; This will be used as a leader in all modes but insert
						  :prefix "SPC"
						  ;; This will be used as a leader key when on insert mode
						  :global-prefix "C-SPC"))

(use-package evil
  :straight t
  :init
  ;; TODO: Learn what this does
  (setq evil-want-integration t)
  ;; Integration with other modes deactivate becase another package is used for that
  (setq evil-want-keybinding nil)
  ;; Make it so C-u scroll instead of emacs default behaviour
  (setq evil-want-C-u-scroll t)
  (evil-mode 1)
  :config
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  (evil-set-undo-system 'undo-redo)

  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line))

(use-package evil-collection
  :straight t
  :after evil
  :init
  (evil-collection-init))

;; Hydra package
(use-package hydra
  :straight t)

;; Hydra definitions
(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("r" (text-scale-set 0) "reset")
  ("q" nil "finish" :exit t))

;; Projectile
(use-package projectile
  :straight t
  :init
  (projectile-mode)
  :config
  (when (file-directory-p "~/Projects")
	;; Limit the amount of subdirectories on which projectile will look into
	(setq projectile-project-search-path '(("~/Projects" . 4))))
  ;; This will show the directory structure when you switch project
  (setq projectile-switch-project-action #'projectile-dired))

;; Magit
(use-package magit
  :straight t
  :custom
  (magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1))

;; Forge
(use-package forge
  :straight t
  :after magit)

;; Org Mode
(defun poli/org-mode-setup ()
  (variable-pitch-mode 0))

(use-package org
  :straight t
  :hook (org-mode . poli/org-mode-setup)
  :config
  ;; Face exceptions: These are the modes that will keep the fixed-pitch font
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil :inherit 'fixed-pitch)


  ;; Structure templates for code snippets, used on org-babel
  ;; org-tempo is required for the templates to work
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))

  )

(defun poli/org-auto-tangle ()
(when (string-equal (buffer-file-name)
					(expand-file-name "~/Projects/Personal/emacs/Config.org"))
(let ((org-confirm-babel-evaluate nil))
(org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'poli/org-auto-tangle)))

(use-package org-bullets
  :straight t
  :after org
  :hook (org-mode . org-bullets-mode))

(use-package flycheck
  :straight t
  :init (global-flycheck-mode))

(use-package company
  :straight t
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
          ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
  :config
  (company-keymap--unbind-quick-access company-active-map)
  (setq company-idle-delay 0.0
        company-minimum-prefix-length 1))

(use-package company-box
  :straight t
  :hook (company-mode . company-box-mode)
  :config
  (setq lsp-ui-doc-position 'bottom))
