Config.org
** Eshell
Eshell buildin package configuration
#+begin_src emacs-lisp

  (defun poli/eshell-config ()
    ;; Save command history
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)
    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-function 'eshell-truncate-buffer)
    ;; Bind some evil mode keys
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'eshell-list-history)
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)

    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignore-dups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell-git-prompt
    :straight t)

  (use-package eshell
    :straight t
    :hook (eshell-first-time-mode . poli/eshell-config)
    :config
    (eshell-git-prompt-use-theme 'powerline))

#+end_src


* LSP
Language server protocol configuration for various languages
** Global LSP Configuration
The first thing we need to do is install the [[https://emacs-lsp.github.io/lsp-mode/][LSP Mode]] package and configure it.
#+begin_src emacs-lisp

  (defun poli/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :straight t
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t)
    :hook (lsp-mode . poli/lsp-mode-setup))

#+end_src

** LSP UI
The package [[https://github.com/sebastiencs/company-box][lsp-ui]] improves the UI of lsp mode
#+begin_src emacs-lisp

  (use-package lsp-ui
    :straight t
    :hook (lsp-mode . lsp-ui-mode))
  
#+end_src

** Golang
Golang is included in emacs, you just have to create a hook
#+begin_src emacs-lisp

  ;; Golang configuration
  (use-package go-mode
  :straight t
  :hook ((go-mode . lsp-deferred)
         (go-mode . company-mode))
  :bind (:map go-mode-map
          ("<f6>" . gofmt)
          ("C-c 6" . gofmt))
  :config
  (require 'lsp-go)
  (setq lsp-go-analyses
    '((field-alignment . t)
      (nillness . t)))
  ;; Gopath
  (add-to-list 'exec-path "~/.local/share/go/bin"))

#+end_src

** Typescript
[[https://github.com/emacs-typescript/typescript.el][Typescript]] LSP configuration for emacs
#+begin_src emacs-lisp

  (use-package typescript-mode
    :straight t
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))

#+end_src


* Keymaps
:properties:
:custom_id: keymaps
:end:
List of keybindings for emacs (normally using general)
#+begin_src emacs-lisp

  ;; Key Definition
  (poli/leader-keys
    ;; Projectile shortcuts
    "p" '(projectile-command-map :which-key "Projectile")

    ;; Write to file
    "w" '(save-buffer :which-key "save buffer")

    ;; Treemacs
    "n" '(treemacs :which-key "open treemacs")

    ;; Find stuff
    "f" '(:ignore t :which-key "find")
    "ff" '(:ignore :which-key "files in project")
    "ffp" '(projectile-find-file :which-key "git files")
    "ffa" '(consult-file :which-key "all files")
    "fb" '(:ignore :which-key "buffers")
    "fbp" '(projectile-switch-to-buffer :which-key "project buffers")
    "fba" '(consult-buffer :which-key "project buffers")
    "fg" '(consult-ripgrep :which-key "all buffers")
    ;; Toggles
    "t"  '(:ignore t :which-key "toggles")
    "ts" '(hydra-text-scale/body :which-key "scale text")
    "tt" '(consult-theme :which-key "choose theme")
  )
#+end_src



* Packages to check
:properties:
:custom_id: packages-to-check
:end:
The list of not installed packages that I ought to check

** TODO [[https://github.com/Wilfred/helpful][Helpful Package]]
Helpful is an alternative to the built-in Emacs help that provides much more contextual information.
